; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-1-4-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-0 - location
	p1-2 - location
	p2-5 - location
	p3-0 - location
	p3-1 - location
	p3-4 - location
	p4-0 - location
	p4-1 - location
	)
	(:init
	(at driver1 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at package1 s4)
	(at package2 s4)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s5)
	(link s5 s3)
	(link s5 s1)
	(link s1 s5)
	(link s5 s2)
	(link s2 s5)
)
	(:goal (and
	(at truck1 s3)
	(at truck2 s1)
	(at truck3 s3)
	(at package1 s3)
	(at package2 s0)
	))


)

; plan
1. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 0 of 5
2. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 1 of 5
3. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 1 of 5
4. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   goals met: 1 of 5
5. (walk driver1 p1-2 s2)
   deleted: (at driver1 p1-2)
   added: (at driver1 s2)
   goals met: 1 of 5
6. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 5
7. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 1 of 5
8. (drive-truck truck1 s0 s3 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 2 of 5
9. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 2 of 5
10. (walk driver1 s3 p3-0)
   deleted: (at driver1 s3)
   added: (at driver1 p3-0)
   goals met: 2 of 5
11. (walk driver1 p3-0 s0)
   deleted: (at driver1 p3-0)
   added: (at driver1 s0)
   goals met: 2 of 5
12. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 2 of 5
13. (drive-truck truck3 s0 s4 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 2 of 5
14. (load-truck package1 truck3 s4)
   deleted: (at package1 s4)
   added: (in package1 truck3)
   goals met: 2 of 5
15. (load-truck package2 truck3 s4)
   deleted: (at package2 s4)
   added: (in package2 truck3)
   goals met: 2 of 5
16. (drive-truck truck3 s4 s0 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 2 of 5
17. (unload-truck package2 truck3 s0)
   deleted: (in package2 truck3)
   added: (at package2 s0)
   goals met: 3 of 5
18. (drive-truck truck3 s0 s3 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 4 of 5
19. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   goals met: 5 of 5
